calculator-ssl-client/src/wsdl/CalculatorWS.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. 
	RI's version is Metro/2.2-b13 (branches/2.2-6964; 2012-01-09T18:04:18+0000) 
	JAXWS-RI/2.2.6-promoted-b20 JAXWS/2.2 svn-revision#unknown. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. 
	RI's version is Metro/2.2-b13 (branches/2.2-6964; 2012-01-09T18:04:18+0000) 
	JAXWS-RI/2.2.6-promoted-b20 JAXWS/2.2 svn-revision#unknown. -->
<definitions
	xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
	xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy"
	xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
	xmlns:tns="http://calculatorssl.wssecurity.ocewsd.abhijitsarkar.certification.edu/"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/"
	targetNamespace="http://calculatorssl.wssecurity.ocewsd.abhijitsarkar.certification.edu/"
	name="CalculatorWS">
	<wsp1_2:Policy xmlns:wsapw3c="http://www.w3.org/2006/05/addressing/wsdl"
		xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy"
		wsu:Id="CalculatorWSPortBindingPolicy">
		<sp:TransportBinding>
			<wsp1_2:Policy>
				<sp:AlgorithmSuite>
					<wsp1_2:Policy>
						<sp:Basic128 />
					</wsp1_2:Policy>
				</sp:AlgorithmSuite>
				<sp:IncludeTimestamp />
				<sp:Layout>
					<wsp1_2:Policy>
						<sp:Lax />
					</wsp1_2:Policy>
				</sp:Layout>
				<sp:TransportToken>
					<wsp1_2:Policy>
						<sp:HttpsToken RequireClientCertificate="false" />
					</wsp1_2:Policy>
				</sp:TransportToken>
			</wsp1_2:Policy>
		</sp:TransportBinding>
		<sp:Wss10 />
		<wsapw3c:UsingAddressing />
	</wsp1_2:Policy>
	<types>
		<xsd:schema>
			<xsd:import
				namespace="http://calculatorssl.wssecurity.ocewsd.abhijitsarkar.certification.edu/"
				schemaLocation="https://abhijits-macbook-pro.local:8181/calculator-ssl/CalculatorWS?xsd=1" />
		</xsd:schema>
	</types>
	<message name="add">
		<part name="parameters" element="tns:add" />
	</message>
	<message name="addResponse">
		<part name="parameters" element="tns:addResponse" />
	</message>
	<portType name="CalculatorWS">
		<operation name="add">
			<input
				wsam:Action="http://calculatorssl.wssecurity.ocewsd.abhijitsarkar.certification.edu/CalculatorWS/addRequest"
				message="tns:add" />
			<output
				wsam:Action="http://calculatorssl.wssecurity.ocewsd.abhijitsarkar.certification.edu/CalculatorWS/addResponse"
				message="tns:addResponse" />
		</operation>
	</portType>
	<binding name="CalculatorWSPortBinding" type="tns:CalculatorWS">
		<wsp1_2:PolicyReference URI="#CalculatorWSPortBindingPolicy" />
		<soap:binding transport="http://schemas.xmlsoap.org/soap/http"
			style="document" />
		<operation name="add">
			<soap:operation soapAction="" />
			<input>
				<soap:body use="literal" />
			</input>
			<output>
				<soap:body use="literal" />
			</output>
		</operation>
	</binding>
	<service name="CalculatorWS">
		<port name="CalculatorWSPort" binding="tns:CalculatorWSPortBinding">
			<soap:address
				location="https://abhijits-macbook-pro.local:8181/calculator-ssl/CalculatorWS" />
		</port>
	</service>
</definitions>