calculator-ssl-client/src/site/soap-request.xml

<?xml version='1.0' encoding='UTF-8'?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
	xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
	xmlns:xs="http://www.w3.org/2001/XMLSchema">
	<S:Header>
		<To xmlns="http://www.w3.org/2005/08/addressing">https://abhijits-macbook-pro.local:8181/calculator-ssl/CalculatorWS
		</To>
		<Action xmlns="http://www.w3.org/2005/08/addressing" xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"
			S:mustUnderstand="1">http://calculatorssl.wssecurity.ocewsd.abhijitsarkar.certification.edu/CalculatorWS/addRequest
		</Action>
		<ReplyTo xmlns="http://www.w3.org/2005/08/addressing">
			<Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
		</ReplyTo>
		<FaultTo xmlns="http://www.w3.org/2005/08/addressing">
			<Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
		</FaultTo>
		<MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:a8f064ef-f56f-4945-9ad4-8423e48efc4f
		</MessageID>
		<wsse:Security S:mustUnderstand="1">
			<wsu:Timestamp
				xmlns:ns14="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512"
				xmlns:ns13="http://www.w3.org/2003/05/soap-envelope" wsu:Id="_1">
				<wsu:Created>2012-04-20T20:15:41Z</wsu:Created>
				<wsu:Expires>2012-04-20T20:20:41Z</wsu:Expires>
			</wsu:Timestamp>
		</wsse:Security>
	</S:Header>
	<S:Body>
		<ns2:add
			xmlns:ns2="http://calculatorssl.wssecurity.ocewsd.abhijitsarkar.certification.edu/">
			<i>1</i>
			<j>2</j>
		</ns2:add>
	</S:Body>
</S:Envelope>